<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html><head><title>Ca est la PuyoCharte</title></head>
<body bgcolor=336698 text=FFFFFF link=FFE664 vlink=FFE664>
<hr><font size=+4 color=FFD300>PuyoCharte::PuyoCharte();</font>
<hr>
Puyo, Puyo. Je vous ai compris !<br>
Apr&egrave;s des ann&eacute;es de frustrations et de privations voici enfin venir l'av&egrave;nement des Puyo unis de Be !<p>
Ce projet a pour but non seulement de developper un palliatif libre (sous license GPL) a l'abscence de Puyopuyo sous BeOS, mais &eacute;galement de constituer un fond de documentation le plus riche possible a destination de tout d&eacute;veloppeur qui voudrait d&eacute;velopper un puzzle game sous BeOS.<p>
Pour rejoindre ce projet peu m'importe donc que vous soyez un programmeur c++ chevronne ou un debutant inexp&eacute;riment&eacute; du moment que vous partagez cette vision et que vous &ecirc;tes plein de bonne volont&eacute;.<p>
Le point le plus important de ce projet n'est pas la qualit&eacute; intrins&egrave;que du code. Un puyopuyo m&ecirc;me peu optimis&eacute; tournera formidablement bien sur les machines actuelles. Ce qui compte c'est la documentation riche et d&eacute;taill&eacute;e que nous allons produire. Tel le carnet de bord d'un vaisseau explorant un oc&eacute;an inconnu, il guidera de ses lumi&egrave;res tous les moussaillons imp&eacute;tueux qui le liront. Tous les ecueils de la conception d'un petit jeu tel que celui-ci seront d&eacute;crits et les montagnes de probl&egrave;mes applanies.<br>C'est donc dans le plus strict esprit du logiciel libre que ce projet sera men&eacute; car il ne se contentera pas de livrer une application pr&ecirc;te a l'emploi, mais il offrira la clef de cette application et de son developpement.
<center><h3>Par amour pour les BeOSiennes, par amour pour les BeOSiens, BePuyo s'offre a vous</h3></center>
<p>
<font size=1>Bon maintenant je vais aller prendre une aspirine et zou ! au lit ;)<p>
</font></font>

</body>
</html>
